; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob26) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 pallet14 - Pallet
	crate0 crate1 crate2 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate1)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate2)
	(at pallet6 distributor0)
	(clear crate0)
	(at pallet7 distributor1)
	(clear pallet7)
	(at pallet8 distributor1)
	(clear pallet8)
	(at pallet9 distributor0)
	(clear pallet9)
	(at pallet10 depot0)
	(clear pallet10)
	(at pallet11 distributor2)
	(clear pallet11)
	(at pallet12 depot2)
	(clear pallet12)
	(at pallet13 distributor0)
	(clear pallet13)
	(at pallet14 distributor0)
	(clear pallet14)
	(at truck0 distributor2)
	(at truck1 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at hoist10 depot2)
	(available hoist10)
	(at hoist11 distributor2)
	(available hoist11)
	(at crate0 distributor0)
	(on crate0 pallet6)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 distributor2)
	(on crate2 pallet5)
)

(:goal (and
		(on crate0 pallet8)
		(on crate1 pallet5)
		(on crate2 pallet10)
	)
))

; plan
1. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 0 of 3
2. (lift hoist7 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist7) (on crate1 pallet0)
   added: (lifting hoist7 crate1) (clear pallet0)
   goals met: 0 of 3
3. (load hoist7 crate1 truck1 depot0)
   deleted: (lifting hoist7 crate1)
   added: (in crate1 truck1) (available hoist7)
   goals met: 0 of 3
4. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 0 of 3
5. (unload hoist8 crate1 truck1 distributor2)
   deleted: (in crate1 truck1) (available hoist8)
   added: (lifting hoist8 crate1)
   goals met: 0 of 3
6. (lift hoist5 crate2 pallet5 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 pallet5)
   added: (lifting hoist5 crate2) (clear pallet5)
   goals met: 0 of 3
7. (load hoist5 crate2 truck0 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   goals met: 0 of 3
8. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 0 of 3
9. (unload hoist7 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist7)
   added: (lifting hoist7 crate2)
   goals met: 0 of 3
10. (drop hoist7 crate2 pallet10 depot0)
   deleted: (lifting hoist7 crate2) (clear pallet10)
   added: (available hoist7) (at crate2 depot0) (clear crate2) (on crate2 pallet10)
   goals met: 1 of 3
11. (drop hoist8 crate1 pallet5 distributor2)
   deleted: (lifting hoist8 crate1) (clear pallet5)
   added: (available hoist8) (at crate1 distributor2) (clear crate1) (on crate1 pallet5)
   goals met: 2 of 3
12. (lift hoist3 crate0 pallet6 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 pallet6)
   added: (lifting hoist3 crate0) (clear pallet6)
   goals met: 2 of 3
13. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 2 of 3
14. (load hoist3 crate0 truck0 distributor0)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck0) (available hoist3)
   goals met: 2 of 3
15. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 2 of 3
16. (unload hoist9 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist9)
   added: (lifting hoist9 crate0)
   goals met: 2 of 3
17. (drop hoist9 crate0 pallet8 distributor1)
   deleted: (lifting hoist9 crate0) (clear pallet8)
   added: (available hoist9) (at crate0 distributor1) (clear crate0) (on crate0 pallet8)
   goals met: 3 of 3
